app/Models/Attribute.php

SELECT *
FROM `ospos_attribute_definitions`
WHERE definition_flags & 1
AND `deleted` = 0
AND `definition_type` <> 'GROUP'
ORDER BY `definition_id`
---
    public function get_definitions_by_flags(int $definition_flags): array
    {
        $builder = $this->db->table('attribute_definitions');
        $builder->where(new RawSql("definition_flags & {$definition_flags}"));    // TODO: we need to heed CI warnings to escape properly
        $builder->where('deleted', 0);
        $builder->where('definition_type <>', GROUP);
        $builder->orderBy('definition_id');

        $results = $builder->get()->getResultArray();

INSERT IGNORE INTO `ospos_attribute_links` (`item_id`, `definition_id`, `attribute_id`, `sale_id`)
SELECT 1, definition_id, attribute_id, 1 FROM ospos_attribute_links WHERE item_id = 1 AND sale_id IS NULL AND receiving_id IS NULL
---

            $builder = $this->db->table('attribute_links');
            $builder->set($data);
            $builder->insert();