app/Models/Sale.php

INSERT INTO `ospos_sales_payments` (`sale_id`, `payment_type`, `payment_amount`, `cash_refund`, `cash_adjustment`, `employee_id`) VALUES (1, 'Cash', '7920', 0, 0, 1)
---
            ];

            $builder = $this->db->table('sales_payments');
            $builder->insert($sales_payments_data);

INSERT INTO `ospos_sales_items` (`sale_id`, `item_id`, `line`, `description`, `serialnumber`, `quantity_purchased`, `discount`, `discount_type`, `item_cost_price`, `item_unit_price`, `item_location`, `print_option`) VALUES (1, '1', 1, '', '', '4', '10', '0', '1500.00', '2200', 1, 0)
---
            ];

            $builder = $this->db->table('sales_items');
            $builder->insert($sales_items_data);